const holidays = _getHolidays();

export default function getDateInfo(isoDateString: string) {
  const days = ['日', '月', '火', '水', '木', '金', '土'];
  const date = new Date(isoDateString);

  if (isNaN(date.getTime())) {
    throw new Error(`${isoDateString}は無効な日付です。正しい日付を入力してください。`);
  }
  const dayIndex = date.getDay();
  const dayName = days[dayIndex];
  const isHoliday = Boolean(holidays[isoDateString]);
  const isSunDay = dayName === '日';
  const isSaturDay = dayName === '土';
  const isNormalDay = !(isHoliday || isSunDay || isSaturDay);
  const month = isoDateString.split('-')[1];
  const dayNumber = isoDateString.split('-')[2].replace(/^0/, '');
  return {
    month: Number(month).toString(),
    day: {
      name: dayName,
      number: dayNumber,
    },
    dayNumber,
    isNormalDay,
    isSunDay,
    isSaturDay,
    isHoliday,
  };
}

// 2025-2026 の祝日
// https://holidays-jp.github.io/ から API の JSON をコピペしている
function _getHolidays(): Record<string, string> {
  return {
    '2024-01-01': '元日',
    '2024-01-08': '成人の日',
    '2024-02-11': '建国記念の日',
    '2024-02-12': '建国記念の日 振替休日',
    '2024-02-23': '天皇誕生日',
    '2024-03-20': '春分の日',
    '2024-04-29': '昭和の日',
    '2024-05-03': '憲法記念日',
    '2024-05-04': 'みどりの日',
    '2024-05-05': 'こどもの日',
    '2024-05-06': 'こどもの日 振替休日',
    '2024-07-15': '海の日',
    '2024-08-11': '山の日',
    '2024-08-12': '休日 山の日',
    '2024-09-16': '敬老の日',
    '2024-09-22': '秋分の日',
    '2024-09-23': '秋分の日 振替休日',
    '2024-10-14': 'スポーツの日',
    '2024-11-03': '文化の日',
    '2024-11-04': '文化の日 振替休日',
    '2024-11-23': '勤労感謝の日',
    '2025-01-01': '元日',
    '2025-01-13': '成人の日',
    '2025-02-11': '建国記念の日',
    '2025-02-23': '天皇誕生日',
    '2025-02-24': '天皇誕生日 振替休日',
    '2025-03-20': '春分の日',
    '2025-04-29': '昭和の日',
    '2025-05-03': '憲法記念日',
    '2025-05-04': 'みどりの日',
    '2025-05-05': 'こどもの日',
    '2025-05-06': 'みどりの日 振替休日',
    '2025-07-21': '海の日',
    '2025-08-11': '山の日',
    '2025-09-15': '敬老の日',
    '2025-09-23': '秋分の日',
    '2025-10-13': 'スポーツの日',
    '2025-11-03': '文化の日',
    '2025-11-23': '勤労感謝の日',
    '2025-11-24': '勤労感謝の日 振替休日',
    '2026-01-01': '元日',
    '2026-01-12': '成人の日',
    '2026-02-11': '建国記念の日',
    '2026-02-23': '天皇誕生日',
    '2026-03-20': '春分の日',
    '2026-04-29': '昭和の日',
    '2026-05-03': '憲法記念日',
    '2026-05-04': 'みどりの日',
    '2026-05-05': 'こどもの日',
    '2026-05-06': '憲法記念日 振替休日',
    '2026-07-20': '海の日',
    '2026-08-11': '山の日',
    '2026-09-21': '敬老の日',
    '2026-09-22': '国民の休日',
    '2026-09-23': '秋分の日',
    '2026-10-12': 'スポーツの日',
    '2026-11-03': '文化の日',
    '2026-11-23': '勤労感謝の日',
  };
}
